sink/openupdate/src/test/resources/mappings/mapping-UpdateService-2.0-93TAp.json

{
  "request" : {
    "url" : "/UpdateService/2.0",
    "method" : "POST",
    "bodyPatterns" : [ {
      "equalToXml" : "<?xml version=\"1.0\" ?><S:Envelope xmlns:S=\"http://schemas.xmlsoap.org/soap/envelope/\"><S:Body><updateRecord xmlns=\"http://oss.dbc.dk/ns/catalogingUpdate\"><updateRecordRequest><authentication><groupIdAut>010100</groupIdAut><passwordAut></passwordAut><userIdAut></userIdAut></authentication><schemaName>dbc</schemaName><bibliographicRecord><recordSchema>info:lc/xmlns/marcxchange-v1</recordSchema><recordPacking>xml</recordPacking><recordData><marcx:collection xmlns:marcx=\"info:lc/xmlns/marcxchange-v1\"><marcx:record format=\"danMARC2\" type=\"Bibliographic\"><marcx:leader>00000n    2200000   4500</marcx:leader><marcx:datafield ind1=\"0\" ind2=\"0\" tag=\"001\"><marcx:subfield code=\"a\">5 195 933 7</marcx:subfield><marcx:subfield code=\"b\">870970</marcx:subfield><marcx:subfield code=\"c\">20151015102339</marcx:subfield><marcx:subfield code=\"d\">20150923</marcx:subfield><marcx:subfield code=\"f\">a</marcx:subfield></marcx:datafield><marcx:datafield ind1=\"0\" ind2=\"0\" tag=\"004\"><marcx:subfield code=\"r\">n</marcx:subfield><marcx:subfield code=\"a\">e</marcx:subfield></marcx:datafield><marcx:datafield ind1=\"0\" ind2=\"0\" tag=\"008\"><marcx:subfield code=\"t\">m</marcx:subfield><marcx:subfield code=\"u\">f</marcx:subfield><marcx:subfield code=\"a\">2015</marcx:subfield><marcx:subfield code=\"b\">dk</marcx:subfield><marcx:subfield code=\"d\">m</marcx:subfield><marcx:subfield code=\"d\">y</marcx:subfield><marcx:subfield code=\"l\">dan</marcx:subfield><marcx:subfield code=\"x\">05</marcx:subfield><marcx:subfield code=\"v\">0</marcx:subfield></marcx:datafield><marcx:datafield ind1=\"0\" ind2=\"0\" tag=\"009\"><marcx:subfield code=\"a\">a</marcx:subfield><marcx:subfield code=\"g\">xx</marcx:subfield></marcx:datafield><marcx:datafield ind1=\"0\" ind2=\"0\" tag=\"021\"><marcx:subfield code=\"c\">Hf.</marcx:subfield></marcx:datafield><marcx:datafield ind1=\"0\" ind2=\"0\" tag=\"032\"><marcx:subfield code=\"x\">ACC201539</marcx:subfield><marcx:subfield code=\"a\">DBF201544</marcx:subfield></marcx:datafield><marcx:datafield ind1=\"0\" ind2=\"0\" tag=\"041\"><marcx:subfield code=\"a\">dan</marcx:subfield><marcx:subfield code=\"d\">eng</marcx:subfield></marcx:datafield><marcx:datafield ind1=\"0\" ind2=\"0\" tag=\"100\"><marcx:subfield code=\"0\"></marcx:subfield><marcx:subfield code=\"a\">Søbjerg Nielsen</marcx:subfield><marcx:subfield code=\"h\">Susanne</marcx:subfield><marcx:subfield code=\"4\">aut</marcx:subfield></marcx:datafield><marcx:datafield ind1=\"0\" ind2=\"0\" tag=\"245\"><marcx:subfield code=\"a\">Et ¤skib er ude af drift</marcx:subfield><marcx:subfield code=\"c\">forsikring og erstatning af ren økonomisk skade</marcx:subfield><marcx:subfield code=\"c\">et bidrag til \"first party insurance\" som kompensationssystem (et retligt perspektiv)</marcx:subfield></marcx:datafield><marcx:datafield ind1=\"0\" ind2=\"0\" tag=\"260\"><marcx:subfield code=\"a\">Kbh.</marcx:subfield><marcx:subfield code=\"b\">Det Juridiske Fakultet, Københavns Universitet</marcx:subfield><marcx:subfield code=\"c\">[2015]</marcx:subfield></marcx:datafield><marcx:datafield ind1=\"0\" ind2=\"0\" tag=\"300\"><marcx:subfield code=\"a\">212 blade</marcx:subfield><marcx:subfield code=\"c\">30 cm</marcx:subfield></marcx:datafield><marcx:datafield ind1=\"0\" ind2=\"0\" tag=\"506\"><marcx:subfield code=\"a\">Ph.d.-afhandling</marcx:subfield></marcx:datafield><marcx:datafield ind1=\"0\" ind2=\"0\" tag=\"508\"><marcx:subfield code=\"a\">Med resumé på engelsk</marcx:subfield></marcx:datafield><marcx:datafield ind1=\"0\" ind2=\"0\" tag=\"521\"><marcx:subfield code=\"&amp;\">REX</marcx:subfield><marcx:subfield code=\"b\">1. oplag</marcx:subfield><marcx:subfield code=\"c\">[2015]</marcx:subfield></marcx:datafield><marcx:datafield ind1=\"0\" ind2=\"0\" tag=\"532\"><marcx:subfield code=\"&amp;\">1</marcx:subfield><marcx:subfield code=\"a\">Med litteraturhenvisninger</marcx:subfield></marcx:datafield><marcx:datafield ind1=\"0\" ind2=\"0\" tag=\"652\"><marcx:subfield code=\"m\">34.535</marcx:subfield></marcx:datafield><marcx:datafield ind1=\"0\" ind2=\"0\" tag=\"900\"><marcx:subfield code=\"0\"></marcx:subfield><marcx:subfield code=\"a\">Nielsen</marcx:subfield><marcx:subfield code=\"h\">Camilla Søbjerg</marcx:subfield><marcx:subfield code=\"z\">100</marcx:subfield></marcx:datafield><marcx:datafield ind1=\"0\" ind2=\"0\" tag=\"d08\"><marcx:subfield code=\"o\">hni</marcx:subfield><marcx:subfield code=\"o\">hlt</marcx:subfield><marcx:subfield code=\"k\">jaw</marcx:subfield></marcx:datafield><marcx:datafield ind1=\"0\" ind2=\"0\" tag=\"d09\"><marcx:subfield code=\"z\">REX201544</marcx:subfield></marcx:datafield><marcx:datafield ind1=\"0\" ind2=\"0\" tag=\"n55\"><marcx:subfield code=\"a\">20150923</marcx:subfield></marcx:datafield><marcx:datafield ind1=\"0\" ind2=\"0\" tag=\"n55\"><marcx:subfield code=\"a\">20150923</marcx:subfield></marcx:datafield><marcx:datafield ind1=\"0\" ind2=\"0\" tag=\"s10\"><marcx:subfield code=\"a\">DBC</marcx:subfield></marcx:datafield><marcx:datafield ind1=\"0\" ind2=\"0\" tag=\"s12\"><marcx:subfield code=\"t\">TeamMUS201542</marcx:subfield></marcx:datafield><marcx:datafield ind1=\"0\" ind2=\"0\" tag=\"z98\"><marcx:subfield code=\"a\">Minus korrekturprint</marcx:subfield></marcx:datafield><marcx:datafield ind1=\"0\" ind2=\"0\" tag=\"z99\"><marcx:subfield code=\"a\">hlt</marcx:subfield></marcx:datafield></marcx:record></marcx:collection></recordData><extraRecordData><ns2:updateRecordExtraData xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:ns2=\"http://oss.dbc.dk/ns/updateRecordExtraData\" xsi:schemaLocation=\"http://oss.dbc.dk/ns/updateRecordExtraData\"><providerName xmlns=\"\" xmlns:ns4=\"http://oss.dbc.dk/ns/catalogingUpdate\">queue</providerName><priority xmlns=\"\" xmlns:ns4=\"http://oss.dbc.dk/ns/catalogingUpdate\">1000</priority></ns2:updateRecordExtraData></extraRecordData></bibliographicRecord><trackingId>wiremock-test</trackingId></updateRecordRequest></updateRecord></S:Body></S:Envelope>"
    } ]
  },
  "response" : {
    "status" : 200,
    "bodyFileName" : "body-UpdateService-2.0-93TAp.json",
    "headers" : {
      "Server" : [ "GlassFish Server Open Source Edition  4.1", "grizzly/2.3.15" ],
      "X-Powered-By" : "Servlet/3.1 JSP/2.3 (GlassFish Server Open Source Edition  4.1  Java/Oracle Corporation/1.8)",
      "Content-Type" : "text/xml; charset=utf-8",
      "Date" : "Wed, 16 Nov 2016 07:56:54 GMT",
      "Transfer-Encoding" : "chunked"
    }
  }
}